_site/notes/emacs/magit.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-11 Sat 05:49 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Magit and Forge</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Magit and Forge</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgae426c9">Rebase and move branch pointers</a></li>
<li><a href="#org201c5ed">View File History</a></li>
<li><a href="#org060addc">View File at Specific Commit</a></li>
<li><a href="#orge5080af">View PR Diff</a></li>
<li><a href="#orgb6cb377">Visit File from Diff</a></li>
<li><a href="#org469de2e">View Current and Previous File Version from Diff</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgae426c9" class="outline-2">
<h2 id="orgae426c9"><a href="#orgae426c9">Rebase and move branch pointers</a></h2>
<div class="outline-text-2" id="text-orgae426c9">
<p>
Do the rebase. The same commits will have different SHAs. Old branches will
still be at previous SHAs.
</p>

<ul class="org-ul">
<li>Go to logs buffer</li>
<li>For each branch:
<ul class="org-ul">
<li>check out branch</li>
<li>move cursor to commit where branch should be moved to</li>
<li><code>x</code> to reset to this commit</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org201c5ed" class="outline-2">
<h2 id="org201c5ed"><a href="#org201c5ed">View File History</a></h2>
<div class="outline-text-2" id="text-org201c5ed">
<ul class="org-ul">
<li><code>M-x magit-log-buffer-file</code></li>
</ul>
</div>
</div>

<div id="outline-container-org060addc" class="outline-2">
<h2 id="org060addc"><a href="#org060addc">View File at Specific Commit</a></h2>
<div class="outline-text-2" id="text-org060addc">
<p>
The function <code>magit-find-file</code> is to "View FILE from REV". Running <code>M-x
  magit-find-file</code> will first prompt for a revision (completes with a list of
all refs), then prompts for a file.
</p>

<p>
From a specific file:
</p>

<ul class="org-ul">
<li><code>M-x magit-log-buffer-file</code></li>
<li>Move to the commit you want</li>
<li><code>M-x magit-find-file</code></li>
</ul>
</div>
</div>

<div id="outline-container-orge5080af" class="outline-2">
<h2 id="orge5080af"><a href="#orge5080af">View PR Diff</a></h2>
<div class="outline-text-2" id="text-orge5080af">
<p>
Requires <a href="https://github.com/magit/forge">forge</a>.
</p>

<ul class="org-ul">
<li>Check out the PR (<code>b</code> <code>y</code>)</li>
<li>From main magit buffer, navigate to the PR and visit it with <code>&lt;enter&gt;</code>.</li>
<li>With cursor at beginning of buffer, <code>d</code> to open the diff menu, then <code>d</code> to
"do what I mean". If this pops up a menu of branches, select the branch you
want to diff against (i.e. the branch the PR will be merged into, probably
<code>main</code>).</li>
</ul>
</div>
</div>

<div id="outline-container-orgb6cb377" class="outline-2">
<h2 id="orgb6cb377"><a href="#orgb6cb377">Visit File from Diff</a></h2>
<div class="outline-text-2" id="text-orgb6cb377">
<p>
Just press <code>&lt;return&gt;</code> on a chunk in the diff. Buuut, if you want it to use
another window:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">magit</span>
  <span style="color: #c678dd;">:bind</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:map</span> magit-diff-mode-map
        <span style="color: #98be65;">(</span><span style="color: #98be65;">"M-&lt;return&gt;"</span> . magit-diff-visit-file-other-window<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org469de2e" class="outline-2">
<h2 id="org469de2e"><a href="#org469de2e">View Current and Previous File Version from Diff</a></h2>
<div class="outline-text-2" id="text-org469de2e">
<ul class="org-ul">
<li>In diff, <code>&lt;return&gt;</code> to visit the file</li>
<li><code>M-x magit-find-file-other-window</code>, branch, <code>&lt;RET&gt;</code></li>
</ul>
</div>
</div>
</div>
</body>
</html>
